const geoCoordMap = {
  京: {
    name: '北京',
    geo: [116.46, 39.92],
  },
  津: {
    name: '天津',
    geo: [117.2, 39.13],
  },
  泸: {
    name: '上海',
    geo: [121.48, 31.22],
  },
  渝: {
    name: '重庆',
    geo: [106.54, 29.59],
  },
  冀: {
    name: '河北',
    geo: [114.48, 38.03],
  },
  晋: {
    name: '山西',
    geo: [112.53, 37.87],
  },
  辽: {
    name: '辽宁',
    geo: [123.38, 41.8],
  },
  吉: {
    name: '吉林',
    geo: [126.57, 43.87],
  },
  黑: {
    name: '黑龙江',
    geo: [126.63, 45.75],
  },
  苏: {
    name: '江苏',
    geo: [118.78, 32.04],
  },
  浙: {
    name: '浙江',
    geo: [120.19, 30.26],
  },
  皖: {
    name: '安徽',
    geo: [117.27, 31.86],
  },
  闽: {
    name: '福建',
    geo: [119.3, 26.08],
  },
  赣: {
    name: '江西',
    geo: [115.89, 28.68],
  },
  鲁: {
    name: '山东',
    geo: [117, 36.65],
  },
  豫: {
    name: '河南',
    geo: [113.65, 34.76],
  },
  鄂: {
    name: '湖北',
    geo: [114.31, 30.52],
  },
  湘: {
    name: '湖南',
    geo: [113, 28.21],
  },
  粤: {
    name: '广东',
    geo: [113.23, 23.16],
  },
  琼: {
    name: '海南',
    geo: [110.35, 20.02],
  },
  川: {
    name: '四川',
    geo: [104.06, 30.67],
  },
  贵: {
    name: '贵州',
    geo: [106.71, 26.57],
  },
  云: {
    name: '云南',
    geo: [102.73, 25.04],
  },
  陕: {
    name: '陕西',
    geo: [108.95, 34.27],
  },
  甘: {
    name: '甘肃',
    geo: [103.73, 36.03],
  },
  青: {
    name: '青海',
    geo: [101.74, 36.56],
  },
  蒙: {
    name: '内蒙古自治区',
    geo: [111.65, 40.82],
  },
  桂: {
    name: '广西壮族自治区',
    geo: [108.33, 22.84],
  },
  藏: {
    name: '西藏自治区',
    geo: [91.11, 29.97],
  },
  宁: {
    name: '宁夏回族自治区',
    geo: [106.27, 38.47],
  },
  新: {
    name: '新疆维吾尔自治区',
    geo: [87.68, 43.77],
  },
  台: {
    name: '台湾',
    geo: [121.58, 24.91],
  },
  港: {
    name: '香港特别行政区',
    geo: [114.19, 22.28],
  },
  澳: {
    name: '澳门特别行政区',
    geo: [113.54, 22.18],
  },
};
export default geoCoordMap;
